[
  {
    "path": "posts/2020-06-05-teaching-online-smoothly/",
    "title": "Teaching online, smoothly",
    "description": "At 12:04 John Mulligan said \"Is it just me or was that incredibly smooth?\"",
    "author": [
      {
        "name": "Mauro Lepore",
        "url": "https://github.com/maurolepore"
      }
    ],
    "date": "2020-06-05",
    "categories": [
      "teaching"
    ],
    "contents": "\nTable of Contents\nWhat we did\nWho we are\nHow we did it\nAt 12:04 John Mulligan said “Is it just me or was that incredibly smooth?” We had just finished teaching 30 people online and it felt super manageable. Read on to see what we did and how.\n\nThe helpers felt the workshop was incredibly smooth.\nWhat we did\nThe workshop was based on the materials and philosophy of The Carpentries – a community of volunteers who “teach foundational coding and data science skills to researchers worldwide” (https://carpentries.org/). It lasted 6 hours, spread over two days (https://maurolepore.github.io/2020-05-12-rice/).\nThe teaching staff included two instructors and four helpers. We followed the kind of advice you get from MetaDocencia (https://metadocencia.netlify.app/):\nWe met twice to discuss and address our concerns before the workshop.\nWe tested the online-meeting platform (Zoom) twice before the workshop.\nWe had enough helpers to manage the number of people we committed to teach.\nWe used, shared, and enforced a code of conduct.\nWe stuck to a simple and predictable schedule: Each block started exactly at the top of the hour, lasted 50’, and was followed by a 10’ break. Despite delays, the structure didn’t change. We allowed lessons to go over to the next block.\nWe asked some people to keep their camera on. This kept the speaker engaged and helped them notice when they lost internet connection.\nWe had redundant channels for internal communication. We sent most private messages via Slack – Zoom’s chat makes it too easy to accidentally send private messages to everyone.\nWe kept learners muted.\nFor notes, questions and feedback we used a collaborative document (Google Doc).\nWe assumed nothing about the learners:\nWe surveyed their experience before the workshop.\nWe introduced them to the code of conduct.\nWe tested they could all use the features of Zoom we cared about.\nWe tested they could all use the collaborative document.\nWe showed them how to efficiently manage the limited screen space.\nWe explained when we expected them to listen or work on a task.\nWe gave them the tools they worked with. (This was a programming workshop, so we gave them the same computing environment (https://rstudio.cloud/) we taught from.\n\nWho we are\nThe learners and helpers were from Rice University. The helpers were mostly graduate students, a few faculty, and one undergraduate student. The helpers were Lisa Spiro, Clinton Heider, Miaomiao Rimmer, and John Mulligan; they were helpful and kind.\nThe instructors were Jackson Hoffart and I; we are data scientists at https://2degrees-investing.org/.\nHow we did it\nThe learners are the ones who know what works best. Ask them and adjust.\nAfter speaking for 5-10 minutes Jackson or I would ask:\nTake two minutes to do this exercise.\nWhen you finish, click the “Yes” button on Zoom.\nIf you have a question, ask on the Google Doc.\nIf you finish early, try the section “Bored?”.\nAnd after each lesson we would ask:\nPlease write down your questions and feedback on the google Doc.\nWhat should we keep doing? And what should we change?\nHow you adapt to feedback is generally straightforward. If most learners finish early, then you may move faster or make exercises harder. If few learners finish on time, then you may give some hint, explain more slowly, make exercises easier, or answer questions from the Google Doc.\nThis worked well for the learners. After the workshop they said the workshop was exceptional – that is beyond excellent.\n\nThe learners scored the workshop as exceptional (Net Promoter Score = 70; https://en.wikipedia.org/wiki/Net_Promoter).\nAnd it also worked for the instructors and helpers. We all learned something from each other and from the experience too.\n\nAs instructors, we shared knowledge and learned from the experience.\n–\nHow about you? What worked for you?\n\n\n",
    "preview": "posts/2020-06-05-teaching-online-smoothly/preview.jpg",
    "last_modified": "2020-06-11T12:18:44-03:00",
    "input_file": {}
  }
]
