[
  {
    "path": "posts/2020-01-01-my-most-recent-work/",
    "title": "My most recent work",
    "description": "My work in 2020.",
    "author": [
      {
        "name": "Mauro Lepore",
        "url": "https://github.com/maurolepore"
      }
    ],
    "date": "2020-12-24",
    "categories": [
      "about-me"
    ],
    "contents": "\n\nContents\nContributions\nTeaching\nBlogs\nPapers\n\nI build software and help people understand their data. Here my work most recent work.\nTwitter, GitHub, LinkedIn, YouTube.\nContributions\nR-packages\nAssociate editor for rOpenSci.\nKeynote speaker for ConnectaR 2021.\nMentor for Chicago R Collaborative.\nExpert for eLife Innovation Leaders 2020.\nPopular books: R for Data Science (Garrett Grolemund and Hadley Wickham), Advanced R (Hadley Wickham).\nPopular R packages: usethis 2.0.0, tidyr 1.1.0, usethis 1.6.0.\nTeaching\nHost of Data science incubator meetups.\nHost of Tidy data science (2-day workshop).\nBlogs\nHost of Data science at 2DII.\nGuest of MetaDocencia: Teaching online, smoothly.\nPapers\nO’Dea, Lepore et al. Nature Scientific Reports (2020). Defining variation in pre-human ecosystems can guide conservation: An example from a Caribbean coral reef (see also news releases here, here, and here).\nLeonard, Lepore et al. Quaternary Science Reviews (2020). Re-evaluating mid-Holocene reef “turn-off” on the inshore Southern Great Barrier Reef.\nLeonard, Lepore et al. Paleoceanography and Paleoclimatology (2020). A U‐Th Dating Approach to Understanding Past Coral Reef Dynamics and Geomorphological Constraints on Future Reef Growth Potential; Mazie Bay, Southern Great Barrier Reef.\nO’Dea, Dillon et al. Conservation Biology (2017). Look to the past for an optimistic future.\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-24T16:42:27-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-01-02-my-older-work/",
    "title": "My older work",
    "description": "My work since a few years before 2020.",
    "author": [
      {
        "name": "Mauro Lepore",
        "url": "https://github.com/maurolepore"
      }
    ],
    "date": "2020-12-24",
    "categories": [
      "about-me"
    ],
    "contents": "\n\nContents\nOlder\nTeaching\nBlogs\nContrubutions to R-packages\nMeetups\n\nTraining\nMeetings\nGrants\n\n\nI build software and help people understand their data. Here is what I did recenly, but before 2020.\nOlder\nTeaching\nI am a Certified instructor of The Carpentries; I train my colleagues in data science weekly since October 2019. Occasionally I also teach. For example:\nMay, 2019: Smithsonian Spring 2019 Edition\nAugust, 2018: Texas A&M University-Kingsville.\nJune, 2018: National Museum of Natural History, Smithsonian Institution.\nMarch, 2018: Smithsonian Environmental Research Center, Smithsonian Institution.\nBlogs\nJanuary, 2018 - August, 2018: Blogging at ForestGEO.\nJuly, 2018: Invited post at ropensci.org about work following rOpenSci’s runconf18.\nActivity on community.rstudio.\nContrubutions to R-packages\nContributed to multiple, popular R-packages (e.g.: dplyr, usethis, styler, roxygen2, pkgdown).\nMeetups\nNovember, 2019: Speaker for the webinar “Ayuda para solicitudes de fusion en GitHub” (Spanish) for DataLatam.\nOctober, 2019: Speaker at the meetup about “Ayuda para solicitudes de fusión en GitHub” (Spanish), for RenBaires, at Medallia Argentina.\nAugust, 2019: Podcast interview at DataLatam Episodio 49, ONGs, ciencia de datos y dateros enfocados en hacer un mundo mejor.\nMay, 2019: Speaker for the webinar: “Uso comun de Git” (Spanish) for DataLatam.\nSince April 2019: Attending biweekly meetups of instructors for The Carpentries at the Smithsonian.\nFebruary - June 2019: Weekly ixpantia masterclass.\nOctober, 2018: Speaker at meetup GitHub for projects, Library of the National Museum of Natural History, Smithsonian Institution.\nJuly-August, 2018: Presentations (built with and about R) at the ForestGEO workshop in Czech Republic:\nhttp://bit.ly/cr18-r-intro.\nhttp://bit.ly/cr18-projects.\nhttp://bit.ly/cr18-pipes.\nhttp://bit.ly/cr18-plots.\n\nAugust, 2018: Speaker at meetup Research with GitHub, National Museum of Natural History, Smithsonian Institution.\nJune 27, 2018: Teaching Assistant at meetup of RLadies-DC, led by Kelly O’Briant.\nJune, 2018: Led meeting, with runconf18 folks, on building R packages.\nMarch, 2017: Speaker for the presentation Manage and share data at the workshop “Digital Data in Paleontological Research”, The University of California Museum of Paleontology (UCMP).\nTraining\nJanuary, 2019: What they forgot to teach you about R aka Getting s*%! done in R - 2 days, by Jenny Bryan and Jim Hester. Austin, USA.\nSeptember, 2018: Writing R functions for fun and profit - 2h, by Jenny Bryan. Buenos Aires, Argentina.\nSeptember, 2018: How to repeat yourself with purrr - half day, by Jenny Bryan. Buenos Aires, Argentina.\nSeptember, 2018: Visualización estática e interactiva de datos usando ggplot2 y plotly - half day, by Natalia da Silva. Buenos Aires, Argentina.\nJune, 2018: DataCarpentry instructor training. Online.\nJune, 2018: Introduction to the Smithsonian Institution High Performance Cluster (SI/HPC). Online.\nMay, 2018: Building tidy tools - 2 days, by Hadley Wickham. San Francisco, USA.\nMeetings\nSeptember, 2019, eLife Innovation Sprint, Cambridge, UK.\nMarch, 2019: chirunconf, Chicago, USA.\nJanuary, 2019:rstudio::conf, Austin, USA.\nSeptember, 2018: LatinR, Buenos Aires, Argentina.\nJuly, 2018: ForestGEO data analysis workshop. 2 weeks. Czech Republic.\nMay, 2018: runconf18, Seattle, USA.\nGrants\nFull scholarship to attand eLife Innovation Sprint, Cambridge, UK.\nDiversity scholarship to attend the chirunconf, R Unconference in Chicago, USA (USD 300).\nDiversity scholarship from rstudio to attend the conference rstudio::conf 2019 (USD 3,000).\nProfessional development scholarship from the Australian Embassy in Buenos Aires (USD 1,600):\nWorkshop Building tidy tools, San Francisco, USA\nLatinR conference, Buenos Aires, Argentina.\n\nAcademic discount from RStudio to attend the workshop Building tidy tools, San Francisco, USA (USD 1,200).\nScholarship to attend rOpenSci’s runconf18, Seattle, USA (~USD 1,500).\n\n\n\n",
    "preview": {},
    "last_modified": "2020-12-24T16:42:18-03:00",
    "input_file": {}
  },
  {
    "path": "posts/2020-06-05-teaching-online-smoothly/",
    "title": "Teaching online, smoothly",
    "description": "At 12:04 John Mulligan said \"Is it just me or was that incredibly smooth?\"",
    "author": [
      {
        "name": "Mauro Lepore",
        "url": "https://github.com/maurolepore"
      }
    ],
    "date": "2020-06-05",
    "categories": [
      "teaching"
    ],
    "contents": "\nTable of Contents\nWhat we did\nWho we are\nHow we did it\nAt 12:04 John Mulligan said “Is it just me or was that incredibly smooth?” We had just finished teaching 30 people online and it felt super manageable. Read on to see what we did and how.\n\nThe helpers felt the workshop was incredibly smooth.\nWhat we did\nThe workshop was based on the materials and philosophy of The Carpentries – a community of volunteers who “teach foundational coding and data science skills to researchers worldwide” (https://carpentries.org/). It lasted 6 hours, spread over two days (https://maurolepore.github.io/2020-05-12-rice/).\nThe teaching staff included two instructors and four helpers. We followed the kind of advice you get from MetaDocencia (https://metadocencia.netlify.app/):\nWe met twice to discuss and address our concerns before the workshop.\nWe tested the online-meeting platform (Zoom) twice before the workshop.\nWe had enough helpers to manage the number of people we committed to teach.\nWe used, shared, and enforced a code of conduct.\nWe stuck to a simple and predictable schedule: Each block started exactly at the top of the hour, lasted 50’, and was followed by a 10’ break. Despite delays, the structure didn’t change. We allowed lessons to go over to the next block.\nWe asked some people to keep their camera on. This kept the speaker engaged and helped them notice when they lost internet connection.\nWe had redundant channels for internal communication. We sent most private messages via Slack – Zoom’s chat makes it too easy to accidentally send private messages to everyone.\nWe kept learners muted.\nFor notes, questions and feedback we used a collaborative document (Google Doc).\nWe assumed nothing about the learners:\nWe surveyed their experience before the workshop.\nWe introduced them to the code of conduct.\nWe tested they could all use the features of Zoom we cared about.\nWe tested they could all use the collaborative document.\nWe showed them how to efficiently manage the limited screen space.\nWe explained when we expected them to listen or work on a task.\nWe gave them the tools they worked with. (This was a programming workshop, so we gave them the same computing environment (https://rstudio.cloud/) we taught from.\n\nWho we are\nThe learners and helpers were from Rice University. The helpers were mostly graduate students, a few faculty, and one undergraduate student. The helpers were Lisa Spiro, Clinton Heider, Miaomiao Rimmer, and John Mulligan; they were helpful and kind.\nThe instructors were Jackson Hoffart and I; we are data scientists at https://2degrees-investing.org/.\nHow we did it\nThe learners are the ones who know what works best. Ask them and adjust.\nAfter speaking for 5-10 minutes Jackson or I would ask:\nTake two minutes to do this exercise.\nWhen you finish, click the “Yes” button on Zoom.\nIf you have a question, ask on the Google Doc.\nIf you finish early, try the section “Bored?”.\nAnd after each lesson we would ask:\nPlease write down your questions and feedback on the google Doc.\nWhat should we keep doing? And what should we change?\nHow you adapt to feedback is generally straightforward. If most learners finish early, then you may move faster or make exercises harder. If few learners finish on time, then you may give some hint, explain more slowly, make exercises easier, or answer questions from the Google Doc.\nThis worked well for the learners. After the workshop they said the workshop was exceptional – that is beyond excellent.\n\nThe learners scored the workshop as exceptional (Net Promoter Score = 70; https://en.wikipedia.org/wiki/Net_Promoter).\nAnd it also worked for the instructors and helpers. We all learned something from each other and from the experience too.\n\nAs instructors, we shared knowledge and learned from the experience.\n–\nHow about you? What worked for you?\n\n\n",
    "preview": "posts/2020-06-05-teaching-online-smoothly/preview.jpg",
    "last_modified": "2020-06-11T12:18:44-03:00",
    "input_file": {}
  }
]
